Revit 2027 API
WallSweep.GetHostIds Method
 Gets a list of all host walls on which the sweep resides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetHostIds()
Public Function GetHostIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetHostIds()
member GetHostIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The list of wall ids.
Remarks
 Fixed wall sweeps from vertically compound structures will return only one host element.
See Also
Reference
WallSweep Class
Autodesk.Revit.DB Namespace